---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.RevitUnableToUpadateGroups
source: html/98b35199-4eca-551a-caa5-4dd0121ee75d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.RevitUnableToUpadateGroups Property

Unable to update groups for changes.

## Syntax (C#)
```csharp
public static FailureDefinitionId RevitUnableToUpadateGroups { get; }
```